package kr.co.Exam07;

public class Exam02 {

	public static void main(String[] args) {
		/*
		 * 리튬전지배터리
		 * 		속성 : 기존용량, 완충횟수, 최대완충횟수
		 * 			현재용량
		 * 		기능 : 충전, 소모, 완전방전
		 * 
		 * 리튬전지배터리 1번 방전 후 완충을 진행 했을 때
		 * 기존 용량 대비 0.02% 용량이 감소한다고 한다.
		 * 완충을 100번 했을 때 200번 했을 때 300번 했을 때
		 * 각각의 사용가능한 용량이 어떻게 되는지 이를 프로그램에서
		 * 구현하여 시뮬레이션 해보세요.
		 * 충/방전을 반복하여 기존용량 대비 사용가능용량이 40%
		 * 되는 시점을 최대완충가능횟수로 설정하세요.
		 * 
		 * 일부 사용자들은 완전 충/방전을 20% 확률로 수행한다고
		 * 가정했을때의 최대완충가능횟수도 구하세요.
		 * (완전 충/방전을 하지 않은 경우 용량감소는 이루어지지
		 * 않습니다.)
		 */

	}

}
