package kr.co.exam02;

public class Exam {

	public static void main(String[] args) {
		/*
		 * 회원 관리를 위한 프로그램을 만들기 위해 다음의 객체 정보가 필요하다.
		 * 		Member : 모든 일반 회원은 해당 객체를 통해 다루어진다.
		 * 				 일반 회원은 게시글쓰기, 게시글보기, 게시글수정 작업만
		 * 				 할 수 있다.
		 * 		Staff : 스태프는 일반 회원들이 작성한 글을 삭제할 수 있는 작업을
		 * 				가진다.
		 * 		Admin : 관리자는 스태프 권한 제거 및 추가, 멤버 가입 및 탈퇴의
		 * 				작업을 할 수 있다.
		 * 
		 * - 위 모든 객체는 이름, 나이 정보를 가지고 있다.
		 * - 위 관계를 파악하여 클래스의 상속, 오버로딩, 오버라이딩, 다형성을 적용하여
		 * 	 다루어 본다.
		 * - 실제 프로그램을 구현하는 것 아님.
		 * - 구현할 메서드는 단순 출력문이 동작하도록 하세요.
		 */

	}

}
